app/views/dogs/_advanced_search.html.erb

        <div class="form-group">
          <%= f.input :breed_id_eq, collection: Breed.all , label: false , prompt: "Escolha a raça" %>
---
SELECT "breeds".* FROM "breeds"