app/views/dogs/show.html.erb


<% @dog.histories.each do |history| %>
---
SELECT "histories".* FROM "histories" WHERE "histories"."dog_id" = $1  [["dog_id", 2]]