app/controllers/breeds_controller.rb

  def index
    @breeds = Breed.paginate(page: params[:page])
---
SELECT  "breeds".* FROM "breeds" ORDER BY "breeds"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @breed = Breed.new(breed_params)

    respond_to do |format|
      if @breed.save
---
INSERT INTO "breeds" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "teste"], ["created_at", 2017-03-22 18:13:59 UTC], ["updated_at", 2017-03-22 18:13:59 UTC]]

  def update
    respond_to do |format|
      if @breed.update(breed_params)
---
UPDATE "breeds" SET "name" = $1, "updated_at" = $2 WHERE "breeds"."id" = $3  [["name", "Bulldog Francês :)"], ["updated_at", 2017-03-22 18:39:49 UTC], ["id", 1]]

  def destroy
    @breed.destroy
---
DELETE FROM "breeds" WHERE "breeds"."id" = $1  [["id", 12]]

    def set_breed
      @breed = Breed.find(params[:id])
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]