app/controllers/dogs_controller.rb

  def index
    @search = Dog.ransack(params[:q])
    @dogs = @search.result(distinct: true).includes(:breed)
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" IN (3, 8, 7, 6, 4, 10, 9, 5, 1, 2)
SELECT "dogs".* FROM "dogs" WHERE (dog_name like '%%')

  def create
    @dog = Dog.new(dog_params)

    respond_to do |format|
      if @dog.save
---
INSERT INTO "dogs" ("breed_id", "dog_name", "gender", "owner_name", "onwer_phone_1", "owner_phone_2", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @dog.update(dog_params)
---
UPDATE "dogs" SET "onwer_phone_1" = $1, "owner_phone_2" = $2, "updated_at" = $3 WHERE "dogs"."id" = $4  [["onwer_phone_1", "(31)3378-8189"], ["owner_phone_2", "(31)9842-1482"], ["updated_at", 2017-03-22 19:15:04 UTC], ["id", 1]]

  def destroy
    @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = $1  [["id", 2]]

    def set_dog
      @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE (dog_name ilike '%#<ActionController::Parameters:0x007fdb586fb0b8>%')